[
{"title": "Pepperoni Pizza Dip {Gluten-free}", "ingredients": [{"section": "General", "items": ["8 ounces cream cheese, softened to room temperature", "2 cups sour cream", "1 1/2 cups shredded cheddar cheese (reserve some for sprinkling on top)", "1/2 tsp. garlic powder or onion powder", "1/2 tsp. dried basil", "1/2 tsp. oregano", "1/4 tsp. salt", "3 oz. pepperoni slices (*verify gluten-free)"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 400°.", "In a mixing bowl, beat together cream cheese and sour cream until well mixed (not smooth, will have pea-sized pieces of cream cheese).", "Add seasonings and stir.", "Add almost all of the cheddar cheese, reserving a small amount for sprinkling on top later.", "Stir together until well mixed.", "Set aside 6-7 slices of pepperoni for the topping. Cut the remaining pepperoni slices in fourths and stir into cheese mixture..", "Scoop mixture into an ungreased casserole dish (8x8 or 9x9 pan, pie plate, or 1 qt. baking dish) and spread with a spatula until smooth.", "Place reserved whole pepperoni slices on top.", "Bake at 400° for 25 minutes. Remove from oven, sprinkle with reserved cheddar cheese and bake for additional 4-5 minutes, or until bubbling and hot.", "Serve with gluten-free crackers and/or chips."]}], "url": "https://mygluten-freekitchen.com/cheesy-pizza-dip-and-crackers-gluten-free/"},
{"title": "Gluten-free Apple Bread", "ingredients": [{"section": "General", "items": ["1 cup buttermilk", "1 egg", "1/4 cup oil (I used corn oil)", "3/4 cup sugar", "2 cups gluten-free flour blend", "3/4 tsp. xanthan gum*", "1 tsp. baking soda", "1/2 tsp. salt"]}, {"section": "cinnamon apples", "items": ["1 cup diced, peeled apples (about 1 large apple or 2 small apples)", "1 tsp. cinnamon"]}, {"section": "Cinnamon Sugar Swirl", "items": ["1/2 cup sugar", "2 tsp. cinnamon"]}], "instructions": [{"section": "Instructions", "steps": ["Spray loaf pan with nonstick cooking spray and set aside.", "Preheat oven to 350°.", "In a small bowl, combine the diced apple chunks and cinnamon. Stir into batter with a spatula just until mixed in.In your mixing bowl, beat together buttermilk, egg, oil, and sugar until mixed.", "Whisk the gluten-free flour blend, xanthan gum, baking soda and salt in another bowl. Then add to the mixing bowl.", "Mix on low until just mixed, but don't overmix.", "In a separate bowl mix together 1/2 cup sugar and 2 tsp cinnamon for layering/swirling", "Scoop half of the batter into the loaf pan. Sprinkle with about half of the cinnamon sugar mixture.", "Scoop the rest of the batter on top. Then sprinkle the remaining cinnamon sugar over the top.", "Take a skewer or long toothpick and drag thru all layers in a snake-like motion, back and forth a few times. This will swirl the cinnamon sugar throughout the batter while still leaving plenty on top!", "Place in the preheated oven and bake at 350° for 55-60 minutes or until a wooden skewer or toothpick inserted the baked loaf comes out with moist crumbs, not batter.", "Cool completely on a wire rack before slicing to serve."]}], "url": "https://mygluten-freekitchen.com/gluten-free-apple-bread/"},
{"title": "Gluten-free Buckeye Brownies", "ingredients": [{"section": "Brownies:", "items": ["⅓ cup Dutch-processed cocoa (I use Saco dutch/natural blend", "½ cup plus 2 tablespoons boiling water", "2 oz. unsweetened chocolate, finely chopped (I use Baker’s squares)", "4 tablespoons (1/2 stick) unsalted butter, melted", "½ cup plus 2 tablespoons oil (I usually use corn or canola)", "2 large eggs", "2 large egg yolks", "2 teaspoons pure vanilla extract", "2½ cups (17½ ounces) sugar", "1¾ cups good quality all-purpose gluten-free flour blend*", "1/2 tsp.xanthan gum", "¾ teaspoon table salt"]}, {"section": "Peanut Butter Layer:", "items": ["3/4 cup creamy peanut butter (I used Jif Natural)", "1/2 cup unsalted butter", "1/8 tsp. salt", "2 1/4 cup powdered sugar", "2 Tbsp. half & half or whole milk", "1 tsp. vanilla extract"]}, {"section": "Chocolate Peanut Butter Glaze:", "items": ["1 1/2 cups semi-sweet chocolate chips", "1/3 cup creamy peanut butter (I used Jif Natural)"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 350°. Make a foil sling for your pan: Cut 18″ length foil and fold lengthwise to 8″ width. Fit foil into length of 13×9″ baking pan (I recommend using a metal one), pushing into corners and up the sides of pan; allow excess to overhang pan edges. Cut 14″ length foil and fit into width of pan in the same manner, perpendicular to the first sheet. Spray foil with nonstick cooking spray.", "In a large, microwave-safe bowl, whisk cocoa and boiling water together until smooth. Add unsweetened chocolate and whisk until the chocolate is melted. If you need to, place the bowl in the microwave in 30 second increments to help melt the chocolate. Whisk in the melted butter and oil. Mixture may look curdled at this point and that’s okay! Add eggs, yolks and vanilla extract, and continue to whisk until smooth and homogenous. Whisk in sugar until fully incorporated.", "In a small bowl, whisk together the gluten-free flour blend, xanthan gum, and salt. Stir the flour mixture into wet ingredients and mix with a rubber spatula until combined.", "Scrape batter into prepared pan and bake at 350° until toothpick inserted halfway between edge and center comes out with just a few moist crumbs attached, 30 to 35 minutes. Transfer pan to a wire rack and cool 1 hour.", "With your electric mixer, beat together the peanut butter, butter and salt on medium speed until smooth and creamy, about 2 minutes. Reduce the speed to low and alternate adding the powdered sugar and the half & half (or milk), mixing to combine after each addition. Add the vanilla extract, beat to combine, then increase the speed to medium-high and beat until completely smooth and creamy. Add extra half and half as needed to get it to a spreadable consistency. Using a spatula, spread the peanut butter mixture in an even layer over the top of the brownies. For this step, I spread it a bit, but then had better success using a sprayed piece of saran wrap or a sprayed food safe glove, and patting the mixture to cover the brownies completely.", "Melt together the chocolate chips and peanut butter in the microwave on 50% power, stirring every 30 seconds, until completely smooth and melted. Pour the mixture over the peanut butter layer and spread into an even layer with a spatula. Refrigerate for at least 30 minutes, or until set.", "When set, cut and serve! The foil sling makes it easy to pull them out and place on cutting board for easy cutting. These cut very nicely with a plastic bladed cutter. You can serve at room temperature or keep chilled."]}], "url": "https://mygluten-freekitchen.com/buckeye-brownies-gluten-free/"},
{"title": "Gluten-free Peanut Butter M&M Cookies", "ingredients": [{"section": "General", "items": ["1 1/4 cup good gluten-free all-purpose flour *", "1/2 tsp. xanthan gum or guar gum (omit if your flour blend has already)", "3/4 tsp. baking soda", "1/2 tsp. baking powder", "1/4 tsp. salt", "1/2 cup unsalted butter, softened (1 stick)", "1 cup peanut butter at room temp (creamy)", "3/4 sugar", "1/2 cup firmly packed light brown sugar", "1 large egg", "1 Tbsp. milk or dairy-free milk alternative", "1 tsp. pure vanilla extract", "1 bag (9-10 oz.) plain M&Ms"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 350°. Line cookie sheets with parchment paper or silicone baking mats.", "In a large bowl, whisk together the gluten-free flour, xanthan gum*, baking soda, baking powder and salt. Set aside.", "In a bowl of your mixer, beat the butter and the peanut butter until fluffy. Add the sugars and beat until smooth. Add the egg and mix well. Add the milk and vanilla extract and mix well. Add the flour mixture and beat thoroughly.", "Hand stir in 1 1/4 cups of the M&Ms.", "Use a small #60 size cookie scoop to scoop round balls of cookie dough. Place onto the parchment or silicone lined cookie sheets, leaving several inches between for expansion. Don't worry if you can't see any M&Ms on top of the cookies. In fact, any M&Ms that are on top of the cookies already will crack while baking. You'll add more after baking instead!", "Bake at 350° for 9-10 minutes. Do not overbake. Cookies may appear to be underdone, but they are not. Remember, these are a soft cookie, don't bake until firm! I pull out when they don't seem sticky anymore. I recommend making a couple test cookies so you can discover exact doneness in your oven. I wouldn't suggest baking more than 10 minutes if you indeed made them with the small scoop like I used.", "Remove from oven and place on cooling rack. Then hand place 2-3 more M&Ms on the top of each cookie. Don't push hard and make your cookies collapse though! Leave the cookies on the parchment lined cookie sheet for a few minutes, then slide the whole parchment paper with cookies off onto your cooling rack to cool completely.", "Makes about 60 cookies, depending on how much of the yummy dough you eat. I recommend using 3 cookie sheets so you can be rotating between scooping, baking, adding more M&Ms, cooling and repeating so you can get through them all! I have large sheets and with this size dough, I could easily get 12-15 per cookie sheet."]}], "url": "https://mygluten-freekitchen.com/gluten-free-peanut-butter-mm-cookies/"},
{"title": "Gluten-free Chicken Stir Fry", "ingredients": [{"section": "General", "items": ["2 Tbsp. canola oil", "1 lb. boneless, skinless chicken thighs or chicken breasts, cut into 1\" pieces", "1/2 tsp. salt", "1/2 tsp. ground black pepper", "1 cup chopped broccoli (1 head)", "1 cup thinly sliced bell pepper", "1/2 red onion, cut into wedges", "1/2 cup snap peas", "1/2 cup carrots, julienned or shredded", "1 cup mung bean sprouts", "3 scallions, cut into 2 inch pieces", "1 tsp. sesame seeds"]}, {"section": "Stir-Fry Sauce", "items": ["1/2 cup gluten-free chicken broth", "1/4 cup gluten-free soy sauce (Tamari)", "1 Tbsp. fresh ginger, minced (or 1/4 tsp. ground ginger)", "1 Tbsp. white distilled vinegar", "1 Tbsp. cornstarch", "1 Tbsp. honey", "2 cloves garlic, minced", "2 tsp. sesame oil", "1/4 tsp. red pepper flakes"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat a large skillet over medium heat. Add 1 tablespoon of the canola oil or other neutral flavored oil to the skillet.", "Season the chicken with salt and pepper on all sides.", "Add chicken to the skillet and cook 3-4 minutes on each side, until chicken is browned and cooked through.", "Remove chicken from pan to a plate and set aside.", "Add the other tablespoon of oil to the pan. Then add broccoli, red onion, and red bell pepper. Cook for 3-4 minutes, until vegetables begin to get tender.", "Stir in the snap peas, carrots, mung bean sprouts and scallions and cook an additional 2-3 minutes.", "While the vegetables are cooking, make the sauce. Combine the sauce ingredients in a bowl. Whisk until no clumps of cornstarch remain.", "Add the chicken back to the pan with the vegetables and pour the sauce over the chicken and vegetables.", "Cook an additional 2-3 minutes, until the sauce thickens.", "Sprinkle with sesame seeds before serving.", "Serve over white rice for a complete meal. Also can be served with rice noodles or quinoa if preferred."]}], "url": "https://mygluten-freekitchen.com/gluten-free-chicken-stir-fry/"},
{"title": "Mini Gluten-free Chocolate Bundt Cakes with Mint Frosting", "ingredients": [{"section": "Cakes:", "items": ["4 oz. unsweetened chocolate, chopped (I used Baker’s)", "1 cup boiling water", "2 cups sugar", "1½ cups good gluten-free all-purpose flour blend*", "¾ tsp. xanthan gum *see note", "¾ tsp. baking soda", "½ tsp. salt", "1 Tbsp. Hershey’s dark cocoa powder", "1/2 cup (1 stick) unsalted butter, melted", "2 large eggs", "2 tsp. pure vanilla extract", "½ cup sour cream (recommend using Daisy or other natural sour cream)"]}, {"section": "Mint Frosting:", "items": ["1 stick (1/2 cup or 8 Tbsp.) salted butter, melted", "3 cups powdered sugar", "3 Tbsp. milk", "1/4 tsp. pure mint extract", "green food coloring (use drops or gel as needed to tint to desired color)"]}], "instructions": [{"section": "Cakes:", "steps": ["Preheat oven to 350°. Spray the cavities of the mini-bundt pan well with non-stick cooking spray.", "Place the chopped unsweetened chocolate in a large mixing bowl and pour the boiling water over it. Let stand for 2 minutes while you prepare the dry ingredients.", "Meanwhile, in a medium bowl, whisk together the sugar, gluten-free flour blend, xanthan gum (*if needed), baking soda, salt, and cocoa powder. Set aside.", "The chocolate in the large mixing bowl should be melted by now. Whisk until chocolate is smooth. Whisk in the butter, then the eggs, until smooth. Whisk in the vanilla and sour cream until well mixed.", "Whisk in the dry ingredients mixture in 3 separate additions, whisking until smooth after each addition.", "Using a scoop, fill each well-greased mini-bundt cavity about 3/4 full.", "Bake at 350° for 15 minutes until well risen and feel firm when pressed in the center. You can also test with a toothpick, which should come out with moist crumbs attached but no wet batter, when inserted into the center of baked cupcake.", "When cupcakes test done, remove pan to a wire rack to cool for about 5 minutes. Gently remove from pan. If you only have one mini-bundt pan, before reusing pan, make sure to coat well again with non-stick cooking spray. Repeat baking and cooling steps until you've used up all of your batter.", "Allow to cool completely before frosting."]}, {"section": "Mint Frosting:", "steps": ["Use your stand mixer or a small bowl with a hand mixer. Add melted butter to mixing bowl. Add 1 cup powdered sugar and 1 Tbsp. milk and beat together. Repeat with next cup of powdered sugar and milk. Once well mixed, repeat with final cup of powdered sugar and milk. Add the peppermint extract and food coloring and beat until well mixed. Check your consistency now and if it doesn't seem just right to pour on the cakes and have it drip down gently, add additional powdered sugar or milk as needed to get it to a glaze consistency.", "Using a spoon, gently pour about 2 tablespoons of frosting on each cake, spreading it gently as needed to cover the top. If your frosting starts to stiffen up as you are working from cake to cake, just put the (microwave-safe) bowl in the microwave for a few seconds and it will get to the right consistency again.", "When you are finished spreading on the glaze, sprinkle with chocolate curls, chocolate sprinkles or jimmies if desired.", "I recommended putting the finished cakes in the refrigerator until about 30-60 minutes before serving, so that the glaze frosting stays."]}], "url": "https://mygluten-freekitchen.com/mini-chocolate-bundt-cakes-mint-frosting-gluten-free/"},
{"title": "Easy Egg Salad", "ingredients": [{"section": "General", "items": ["6 hard boiled eggs, peeled and chopped", "1/3 cup mayonnaise", "1 tsp. yellow mustard", "3/4 tsp. salt", "1/2 tsp. pepper", "1/2 tsp. sugar", "1 scallion, thinly sliced*"]}], "instructions": [{"section": "Instructions", "steps": ["In a large bowl, stir together all ingredients.", "Serve immediately, or place in refrigerator until ready to eat."]}], "url": "https://mygluten-freekitchen.com/easy-egg-salad/"},
{"title": "Gluten-free Banana Nut Bread", "ingredients": [{"section": "General", "items": ["1 cup sugar", "1/2 cup (8 Tbsp.) butter or shortening (room temperature)", "2 eggs", "1 cup mashed bananas (about 3 very ripe bananas)", "1/4 cup buttermilk", "2 cups good quality gluten-free flour blend", "1/2 tsp. xanthan gum (if needed, see note)", "1 1/2 tsp. baking powder", "1/2 tsp. baking soda", "1/2 tsp. salt", "1/2 cup chopped pecans"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 350°.", "In the bowl of your mixer, cream together the sugar and the room temperature (slightly soft) butter or shortening for 1 minute.", "Beat in the eggs one at a time on medium just until mixed in.", "Add the mashed bananas and buttermilk and mix on medium for 1 minutes.", "In a separate bowl, whisk together the gluten-free flour blend, xanthan gum (if needed), baking powder, baking soda, and salt.", "Add the dry ingredients to the banana mixture about a third at a time, mixing on low between additions.", "Add the chopped pecans and either stir by hand with a spatula, or for a short time with your mixer on low. Just until pecans are mixed in.", "Spread the batter into a loaf pan that has been sprayed with non-stick cooking spray. My pan is 9x4x4\".  Choose a pan that is about 8-9\" long and 3.5-5\" wide.", "Bake at 350° for 60-70 minutes -", "For my 9x4x4 pan in an electric oven, it took 65 minutes.", "Remove pan and place on cooling rack. Wait to slice and serve until completely cooled or it will fall apart."]}], "url": "https://mygluten-freekitchen.com/gluten-free-banana-nut-bread/"},
{"title": "Gluten-free Cinnamon Roll Muffins", "ingredients": [{"section": "General", "items": ["2 cups gluten-free flour blend", "3/4 tsp. xanthan gum (if needed - see note)", "3 Tbsp. sugar", "3 tsp. baking powder", "1/2 tsp salt", "1 cup milk", "3 Tbsp salted butter, melted and cooled", "1 egg"]}, {"section": "Topping and Filling:", "items": ["2/3 cup brown sugar", "1 Tbsp. cinnamon", "3 Tbsp. melted butter", "1/4 tsp pure vanilla extract"]}, {"section": "Frosting:", "items": ["3 ounces cream cheese (room temp preferred)", "3/4 cup powdered sugar", "1 Tbsp. melted butter", "1/4 tsp. pure vanilla extract", "2-4 tsp. milk"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 400°. Spray your muffin tin with cooking spray or line with paper liners.", "In a large bowl, whisk together the gluten-free flour, xanthan gum (if needed), sugar, baking powder, and salt.", "In a small bowl, mix together the milk, melted butter, and egg.", "Make a well in the center of the flour mixture and add the egg mixture, stirring with a spatula or wooden spoon until combined.", "In another bowl, whisk together the brown sugar and cinnamon. Add the melted butter and vanilla extract and stir until combined.", "Take 3 tablespoons of the brown sugar mixture and stir it in just slightly into the large bowl of muffin batter. I left some swirls in my batter. Set aside the rest of the brown sugar mixture for using as the topping.", "Scoop muffin batter equally into 12 muffin cups - about 3 Tablespoons of batter into each. (I used the large cookie scoop #20 linked below which is exactly 3 Tablespoons.", "Top with remaining brown sugar mixture.", "Bake at 400° for 14-15 minutes or until muffins spring back when pressed lightly.", "Remove from oven and let cool on a wire rack.", "Beat together all of the frosting ingredients (I used a hand mixer). Add frosting onto each muffin. I used a small cookie scoop #60 which is 1 tablespoon and then used the back of a spoon to spread it out. Or if you prefer you can add ore milk to the frosting to make a thinner consistency and  drizzle it over them.", "Enjoy!"]}], "url": "https://mygluten-freekitchen.com/gluten-free-cinnamon-roll-muffins/"},
{"title": "Gluten-free Peanut Butter Cookies", "ingredients": [{"section": "General", "items": ["1 1/4 cup good gluten-free all-purpose flour *", "1/2 tsp. xanthan gum (*see note)", "3/4 tsp. baking soda", "1/2 tsp. baking powder", "1/4 tsp. salt", "1/2 cup unsalted butter, softened (1 stick), margarine, or organic vegetable shortening", "1 cup peanut butter at room temp (smooth or chunky)", "3/4 cup sugar", "1/2 cup firmly packed light brown sugar", "1 large egg", "1 Tbsp. milk or dairy-free milk alternative", "1 tsp. pure vanilla extract", "1 cup Reese's peanut butter baking chips", "Additional 3 Tbsp. sugar for rolling dough"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 350°. Line cookie sheets with parchment paper or silicone baking mats.", "In a large bowl, whisk together the flour, xanthan gum, baking soda, baking powder and salt. Set aside.", "In a bowl of your mixer, beat the butter and the peanut butter for 1 minute on medium-high speed until creamy.", "Add the sugars and beat 1 minute.", "Add the egg, milk and vanilla extract and mix well.", "Add the flour mixture and mix on low speed until all flour is mixed in.", "Stir in the peanut butter baking chips.", "Place the 3 Tbsp. sugar in a small bowl. Use a medium cookie scoop (#40) to make balls of dough that weigh 1 1/8 oz. or 30 grams. Roll dough balls in sugar, then place onto the parchment or silicone lined cookie sheets.", "Bake for 12-13 minutes. Cookies won't look wet or gooey on outside when done. Do not overbake. Cookies may appear to be underdone, but they are not. Remember, these are a soft cookie, don't bake until firm!", "Cool the cookies on the sheet for a minute, then remove to cool completely.", "Makes about 32-36 cookies, depending on how much of the yummy dough you eat."]}], "url": "https://mygluten-freekitchen.com/double-peanut-butter-cookies-gluten-free/"},
{"title": "Gluten-free Chicken Salad", "ingredients": [{"section": "General", "items": ["3/4 cup mayonnaise", "1 Tbsp. fresh dill (see note)", "1/4 tsp. garlic salt", "1/4 tsp. salt", "1/4 tsp. pepper", "2 cups (about 1/2 lb) cooked, chopped chicken", "1/4 cup chopped toasted pecans", "1/4 cup chopped celery", "1/4 cup dried cranberries", "1/4 cup chopped onions"]}], "instructions": [{"section": "Instructions", "steps": ["In a medium bowl, stir together mayonnaise, dill, garlic salt, salt, and pepper.", "Add all the remaining ingredients (chicken, pecans, celery, cranberries, onions) and stir until combined.", "Taste and add additional seasonings as desired.", "Serve immediately with gluten-free crackers or on gluten-free buns, or cover bowl with plastic wrap and place in refrigerator until ready to eat."]}], "url": "https://mygluten-freekitchen.com/gluten-free-chicken-salad/"},
{"title": "Gluten-free Brownie Pudding Toffee Trifle", "ingredients": [{"section": "General", "items": ["1 9x13 pan of gluten-free brownies", "2 1/2 cups cold milk", "2 small boxes (3.3 oz. each) Jell-O instant pudding mix (white chocolate or cheesecake flavor)", "1 carton (8 oz.) Cool Whip whipped topping or homemade whipped cream (see note)", "4 oz. (1/2 bag) of Heath English Toffee Bits"]}], "instructions": [{"section": "Instructions", "steps": ["Bake a batch of my", "or a good quality 9x13 gluten-free brownie mix. Let cool completely. Cut brownies into 1\" cubes. (Note: this step can be done day ahead)."]}], "url": "https://mygluten-freekitchen.com/brownie-pudding-toffee-trifle-gluten-free/"},
{"title": "Best Gluten-free Double Chocolate Fudge Pie", "ingredients": [{"section": "General", "items": ["1 box (6.3 oz.) of Enjoy Life gluten-free double chocolate crunch cookies", "1/3 cup butter or coconut oil, room temperature", "2 Tbsp. brown sugar", "1/3 cup (slightly mounded) semi-sweet mini chips, (about 2 ounces)", "1/2 cup (=1 stick or 8 Tbsp.) butter", "3/4 cup sugar", "2 large eggs", "1/4 cup gluten-free flour blend with xanthan gum", "1 tsp. pure vanilla extract", "1/4 tsp. salt", "3/4 semi-sweet mini chips"]}], "instructions": [{"section": "Instructions", "steps": ["Remove cookies from packaging and pulse them all in a food processor, until you have coarse crumbs. You may need to do this in two batches, depending on the size of your food processor. This will yield just about 2 cups of cookie crumbs.", "Transfer cookie crumbs to a medium or large bowl and add brown sugar. Use spatula or whisk to mix together well.", "Pour the melted butter or melted coconut oil over the cookie crumb mixture. Stir with a spatula until all is wet and well mixed.", "Press cookie mixture into an ungreased 9\" pie pan. Press evenly all over bottom and up sides of pan most of the way. I went about 2/3 or 3/4 up the sides of my pan. There isn't a need to go all the way up to the top as the pie filling isn't that high.", "Set crust aside while you make the filling.", "Place the 1/3 cup of semi-sweet chocolate in a microwave safe bowl and microwave in 30 second increments, stirring after each, until chunks/chips are melted and smooth. This took a total of 1 1/2 minutes for me. Set aside.", "In the bowl of your stand mixer, add the butter and sugar and beat on medium -high speed for 2 minutes.", "Add the melted chocolate and beat on medium speed until mixed.", "Add the eggs, gluten-free flour, pure vanilla extract, salt, and beat on medium speed for 1 minute.", "Stir in the 3/4 cup of mini chips, scraping sides of bowl to mix in anything that wasn't mixed well.", "Pour this mixture into the pie crust. Bake the pie at 325° for 30 minutes. Pie will have a nice golden brown surface but will still be jiggly underneath if you give it a little shake. It will set up as it cools. Remove to a wire rack and let cool 1 hour before slicing."]}], "url": "https://mygluten-freekitchen.com/best-gluten-free-chocolate-fudge-pie/"},
{"title": "Dairy-free Orange Creamsicle Smoothie", "ingredients": [{"section": "General", "items": ["5-6 ounces of vanilla flavored non-dairy yogurt alternative", "1 large orange", "1 banana", "1/4 cup liquid non-dairy creamer (plain or vanilla)", "2 tsp. ground flaxseed", "1-4 ice cubes, if desired"]}], "instructions": [{"section": "Instructions", "steps": ["Add non-dairy yogurt alternative to blender. Containers of non-dairy yogurt typically range from 5-6 ounces, thus the range listed. Use your preferred kind!", "Peel the orange, remove seeds and center pith. Add orange to blender.", "Peel the banana and add to blender.", "Add 1/4 cup liquid non-dairy creamer.", "Add 2 teaspoons flaxseed.", "Place lid on blender and blend about 1 minute, or until well blended. If you'd like it colder, add   1-4 ice cubes, place lid on again and blend about 30 more seconds.", "Serve! This makes one large smoothie - perfect for breakfast to go!"]}], "url": "https://mygluten-freekitchen.com/dairy-free-orange-creamsicle-smoothie/"},
{"title": "Gluten-free Oatmeal Chocolate Chip Cookies (dairy-free)", "ingredients": [{"section": "General", "items": ["2 cups all-purpose gluten-free flour blend", "1/2 tsp xanthan gum*", "1 tsp. baking soda", "3/4 tsp. salt", "1/2 tsp. cinnamon", "1 cup (16 Tbsp.) non-dairy butter alternative or butter, room temperature", "1 3/4 cups brown sugar", "2 large eggs", "1 tsp. pure vanilla extract", "2 cups certified gluten-free rolled oats", "1 to 1 1/2 cups semi-sweet chocolate mini chips"]}], "instructions": [{"section": "Instructions", "steps": ["Line cookie sheets with parchment paper and set aside.", "In a medium bowl, whisk together flour, xanthan gum (if needed), baking soda, salt, and cinnamon. Set aside.", "In the bowl of your electric mixer, beat together the non-dairy butter alternative and the brown sugar on medium speed until light in color and well-mixed, about 3 minutes.", "Beat in the eggs, one at a time, on medium speed until mixed.", "Add the pure vanilla extract and beat just until mixed.", "With mixer on low speed, add half of the flour mixture. Once mixed in, add the other half. Mix just until combined.", "Add the oats, and mix on low until combined, or stir in by hand.", "Stir in the semi-sweet chocolate mini chips.", "Cover bowl with plastic wrap and place in refrigerator for at least 20 minutes, or up to 2 days. Remove from fridge, and scoop using a small #60 cookie scoop, scoop balls of dough and place 2 inches apart on your parchment lined cookie sheet.", "Bake at 350° for 9-10 minutes or until lightly browned. If you'd like them to be crispier, bake a few minutes longer."]}], "url": "https://mygluten-freekitchen.com/gluten-free-oatmeal-chocolate-chip-cookie-dairy-free/"},
{"title": "Gluten-free Beef Stew in Slow Cooker", "ingredients": [{"section": "General", "items": ["2 lbs. beef chuck, cut into 1 inch pieces", "1/4 teaspoon salt", "1/4 teaspoon ground black pepper", "1 tablespoon olive oil", "1 large white onion, diced", "2 stalks celery, cut into 1/2 inch pieces (about 1 cup total)", "1 lb. Yukon gold potatoes, cut into 1/2 inch to 1 inch cubes (leave skins on)", "3 large carrots, cut into 1/2 inch pieces (about 1 cup total)", "32 oz beef broth, gluten-free", "1/2 teaspoon salt", "1/2 teaspoon ground black pepper", "3 tablespoons tomato paste", "1 tablespoon Worcestershire sauce, gluten-free", "2 cloves garlic, minced", "2 whole bay leaves, dried", "1 teaspoon dried thyme", "2 tablespoons cornstarch", "1 cup frozen peas", "fresh thyme sprigs, for serving"]}], "instructions": [], "url": "https://mygluten-freekitchen.com/gluten-free-beef-stew-in-slow-cooker/"},
{"title": "Gluten-free Chocolate Banana Cookies", "ingredients": [{"section": "General", "items": ["1/2 cup semi-sweet chocolate mini chips", "1/2 cup sugar", "6 Tbsp. non-dairy butter alternative or butter (cold)", "1 medium/large overripe banana, mashed", "1 large egg", "1 1/4 c. gluten-free all-purpose flour blend", "1/2 tsp. xanthan gum*", "1 tsp. baking powder", "1/4 tsp. baking soda", "1/4 tsp. salt", "1/3 cup semi-sweet chocolate mini chips"]}], "instructions": [{"section": "Instructions", "steps": ["Melt the semi-sweet chocolate mini chips in a bowl in the microwave. I do this in 30 second increments, stirring in between, until melted and smooth.", "Add melted chocolate to your mixing bowl", "In the bowl of your stand mixer, beat together the melted chocolate, sugar, non-dairy butter alternative, mashed banana and egg for 3 minutes on medium speed, stopping partway through to scrape the sides of bowl.", "In a small bowl, whisk together gluten-free all-purpose flour, xanthan gum, baking powder, baking soda, and salt.", "With mixer on low, slowly add the dry ingredients and mix for 1 minute.", "Stir in the remaining 1/3 cup semi-sweet chocolate mini chips.", "Use a #40 cookie scoop to scoop large cookies onto parchment paper lined sheets, leaving a couple inches between each cookie for spreading.", "Bake at 400° for 8-9 minutes, or until cookies are set and puffy.", "Remove from oven to a cooling rack. If desired, sprinkle additional mini chips in the center of each cookie if you'd like them to look like my photos.", "Once cooled, enjoy! Store leftover cookies in a cookie jar or airtight container. Or stack and freeze in a Ziploc freezer bag."]}], "url": "https://mygluten-freekitchen.com/gluten-free-chocolate-banana-cookies/"},
{"title": "Gluten-free Peanut Butter Butterscotch Chocolate Chip Cookies", "ingredients": [{"section": "General", "items": ["1 1/4 cup good gluten-free all-purpose flour *", "1/2 tsp. xanthan gum or guar gum (omit if your flour blend has already)", "3/4 tsp. baking soda", "1/2 tsp. baking powder", "1/4 tsp. salt", "1/2 cup unsalted butter, softened (1 stick), margarine, or organic vegetable shortening", "1 cup peanut butter at room temp (smooth or chunky)", "3/4 sugar", "1/2 cup firmly packed light brown sugar", "1 large egg", "1 Tbsp. milk or dairy-free milk alternative", "1 tsp. pure vanilla extract", "3/4 cup butterscotch morsels", "3/4 cup semi-sweet chocolate chips"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 350°. Line cookie sheets with parchment paper or silicone baking mats.", "In a large bowl, whisk together the flour, xanthan gum, baking soda, baking powder and salt. Set aside.", "In a bowl of your mixer, beat the butter and the peanut butter until fluffy. Add the sugars and beat until smooth. Add the egg and mix well. Add the milk and vanilla extract and mix well. Add the flour mixture and beat thoroughly.", "With the mixer on low, mix in the butterscotch morsels and semi-sweet chocolate chips just until mixed. You can hand stir these as well.", "Use a medium size cookie scoop to scoop round balls of cookie dough. Place onto the parchment or silicone lined cookie sheets, leaving several inches between for expansion.", "Bake for 12-13 minutes. Do not overbake. Cookies may appear to be underdone, but they are not. Remember, these are a soft cookie, don't bake until firm!", "Cool the cookies on the sheet for a minute, then remove to cool completely. If you'd like, you can gently press in additional butterscotch and chocolate chips into the tops of the cookies while the cookies are still hot.", "Makes about 32-36 cookies, depending on how much of the yummy dough you eat."]}], "url": "https://mygluten-freekitchen.com/gluten-free-peanut-butter-butterscotch-chocolate-chip-cookies/"},
{"title": "Crockpot Gluten-free Chili", "ingredients": [{"section": "General", "items": ["1 lb. ground beef", "1 tsp. garlic powder", "4 cans (16 oz. each) red kidney beans", "3 cans (14.5 oz each) petite diced tomatoes", "1 can (8 oz.) tomato sauce", "4 oz. water (I just fill half of the tomato sauce can)", "1/2 cup sweet bbq sauce", "4 Tbsp. chili powder", "4 garlic cloves, chopped", "2 tsp. pepper", "2 tsp. salt", "1 tsp. ground cumin", "1 tsp. smoked paprika"]}], "instructions": [{"section": "Instructions", "steps": ["Cook the ground beef (or turkey/elk/bison) in a skillet. Season with the teaspoon of garlic powder while cooking. Cook fully. Drain excess grease, then add to the Crockpot.", "Open all of the cans of kidney beans into a strainer. Rinse the beans. Add to the Crockpot.", "Add all remaining ingredients listed. Stir.", "Cover. Cook on low for 8-10 hours. Stir once or twice throughout the day if desired and before serving.", "Serve with your preference of toppings like shredded cheese, onions, sour cream, Fritos, cornbread."]}], "url": "https://mygluten-freekitchen.com/crockpot-gluten-free-chili/"},
{"title": "Gluten-free Chocolate Chip Waffles Recipe", "ingredients": [{"section": "General", "items": ["2 large eggs", "1 3/4 cups dairy-free milk", "1/2 cup oil", "2 cups gluten-free flour blend", "3/4 tsp. xanthan gum* (see note)", "1 Tbsp. sugar", "4 tsp. baking powder", "1/4 tsp. salt", "1/3 cup semi-sweet mini chocolate chips"]}], "instructions": [{"section": "Instructions", "steps": ["In a large bowl, beat the eggs well with a whisk.", "Add dairy-free milk and oil and whisk until combined.", "Add gluten-free flour blend, xanthan gum (if needed), sugar, baking powder, and salt. Whisk about 2 minutes until well mixed. Batter will still have small lumps.", "Use a spatula to stir in the 1/3 cup semi-sweet mini chocolate chips. If you'd like more, feel free to add more!", "Set batter aside to rest.", "Spray surfaces of waffle iron with cooking spray and allow to heat up. Once ready, scoop out 2 Tbsp. batter per 4\" waffle. This might vary depending on the size of your waffle iron. For my heart shaped waffles, this was the correct amount. For square waffles on my larger iron, this was also the correct amount for each 4\" square.", "Once waffle iron indicates they are done cooking, remove carefully to your serving tray and serve.", "Enjoy with fresh fruit like bananas, raspberries, blueberries, or strawberries. Add dairy-free whipped topping and dairy-free chocolate syrup if desired."]}], "url": "https://mygluten-freekitchen.com/gluten-free-chocolate-chip-waffles-recipe/"},
{"title": "Gluten-free Chocolate Chip Mini Bundt Cakes (dairy-free)", "ingredients": [{"section": "Cakes:", "items": ["1 cup dairy-free milk alternative", "1 tsp. pure vanilla extract", "3 cups good quality gluten-free flour blend", "1 tsp. xanthan gum (see note)", "1 Tbsp. baking powder", "3/4 tsp. salt", "1 cup (2 sticks) butter alternative like Earth Balance sticks", "1 1/2 cups sugar", "1/2 cup brown sugar", "4 eggs (size large)", "1 cup Enjoy Life semi-sweet chocolate mini chips"]}, {"section": "Frosting:", "items": ["1/2 cup (1 stick) butter alternative like Earth Balance sticks", "1/2 cup cocoa powder (see note)", "5 Tbsp. non-dairy milk alternative", "3 2/3 cup powdered sugar", "1 tsp. pure vanilla extract"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat the oven to 350°. Spray the cavities of the mini bundt pan thoroughly with non-stick cooking spray. Set aside", "In a glass measuring cup, measure one cup of your non-dairy milk alternative. I used flax milk. Add the teaspoon of pure vanilla extract to it and set aside.", "In a medium bowl, whisk together the gluten-free flour, xanthan gum (if needed), baking powder, and salt. Set aside.", "In the bowl of your stand mixer, cream the non-dairy butter alternative with the sugar and brown sugar for 3-5 minutes or until creamy and fluffy. Stop a few times to scrape sides of bowl.", "With the mixer on low, add the eggs, one at a time, mixing well on low speed after each addition.", "With the mixer on low, slowly add some of the flour mixture, then some of the milk mixture, alternating until all is mixed together.", "Stir in the mini chocolate chips, scraping the bottom and sides of bowl to ensure all batter is mixed together well.", "If using the same pan I recommended, scoop 2.5 Tbsp of batter into each cavity of the mini bundt pan.", "Bake at 350° for 18 minutes. Remove from oven to cooling rack. Let cool in pan for 3-5 minutes, then flip over pan to roll baked cakes onto cooling rack.", "This makes 36 mini bundt cakes. If you only have one pan, like I do, then you'll want to make sure to wipe out the crumbs as best you can, and spray the cavities very well with non-stick cooking spray before adding the next batch of batter.", "While cakes finish cooling, make frosting.", "In a microwave safe bowl, microwave butter alternative for about 20-30 seconds.", "Add cocoa powder, 1 Tbsp non-dairy milk alternative and beat with hand mixer or stand mixer for 30 seconds.", "Alternate adding powdered sugar and remaining non-dairy milk alternative, beating well after each addition.", "Use a spatula to scrape down the sides of the bowl. Add pure vanilla extract and beat until mixture is smooth and shiny.", "Use a mounded teaspoon to scoop frosting into center of each mini cake."]}], "url": "https://mygluten-freekitchen.com/gluten-free-chocolate-chip-mini-bundt-cakes-dairy-free/"},
{"title": "Easy Gluten-free Carrot Cake", "ingredients": [{"section": "Cake:", "items": ["2 1/2 cups all-purpose gluten-free flour*", "3/4 tsp. xanthan gum (*see note)", "1 1/4 tsp. baking powder", "1 tsp. baking soda", "2 tsp. ground cinnamon", "1/4 tsp. ground nutmeg", "1/8 tsp. ground cloves", "1/4 tsp. ground allspice", "1/2 tsp. salt", "1 1/4 cups sugar", "3/4 cup brown sugar", "4 large eggs", "1/3 cup unsweetened applesauce", "2/3 cup canola or vegetable oil or melted coconut oil", "1/2 cup melted unsalted butter (or oil)", "3 cups finely shredded carrots (from about 1 lb. carrots)"]}, {"section": "Frosting:", "items": ["8 ounces cream cheese, softened to room temperature", "5 Tbsp. butter, softened to room temperature", "2 1/2 - 3 cups powdered sugar", "2 Tbsp. heavy cream or half and half", "2 tsp. pure vanilla extract"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 350°. Spray 9x13 pan with cooking spray. I used a glass Pyrex pan.", "In a medium bowl, whisk together flour, xanthan gum, baking powder, baking soda, cinnamon, nutmeg, cloves, allspice, and salt. Set aside.", "In the bowl of your standing mixer, beat sugar, brown sugar and eggs on medium-high speed until thoroughly combined, about 45 seconds.", "Reduce speed to low, and slowly add the applesauce, oil, and melted butter. Mix on high for one minute, or until mixture is well mixed and light in color.", "Turn off mixer and stir in by hand the carrots and dry ingredients until no loose flour remains.", "Pour into greased 9x13 pan. Bake at 350° for 35-40 minutes or until a toothpick inserted into center of cake comes out clean. (Mine took 37 minutes.)", "Let cake cool, in pan, on a wire rack."]}, {"section": "When cake is cool, mix up cream cheese icing:", "steps": ["In a mixing bowl, use a hand mixer to beat the softened cream cheese and butter for 3 minutes, or until soft, creamy and combined thoroughly.", "Add 2 cups of powdered sugar and beat until well mixed.", "Add the heavy cream or half and half, and pure vanilla extract. Beat on medium speed for 2 minutes.", "Add an additional 1/2 to 1 cup of powdered sugar until frosting reaches desired thickness and taste.", "Use a spatula or icing knife to spread frosting evenly over cooled cake. Slice into 15 large slices, or you can cut smaller slices if you prefer."]}], "url": "https://mygluten-freekitchen.com/carrot-cake-gluten-free/"},
{"title": "Berry Sauce Recipe", "ingredients": [{"section": "General", "items": ["4 cups total fresh or frozen unsweetened sliced strawberries and/or raspberries, marionberries or blackberries", "2/3 cup sugar", "2 tsp. vanilla"]}], "instructions": [{"section": "Instructions", "steps": ["In a medium saucepan, combine the berries, sugar, and vanilla.", "Cook over medium heat, mashing fruit and stirring occasionally, until sauce thickens, about 10 minutes. Remove from heat.", "Now pour all of the sauce into a blender and puree/blend until smooth, about 10-15 seconds.", "Store in refrigerator until ready to serve (unless you want to serve it warm)."]}], "url": "https://mygluten-freekitchen.com/summer-berry-sauce/"},
{"title": "Gluten-free Chocolate Strawberry Layer Cake", "ingredients": [{"section": "Cake:", "items": ["2 cups good quality gluten-free all-purpose flour blend*", "1 tsp. xanthan gum (see note)", "2 cups sugar", "1 tsp. baking soda", "1/4 tsp. salt", "1 cup salted butter", "1/3 cup cocoa powder (I use part Hershey's Dark Cocoa, and part regular cocoa)", "1 cup water", "1/2 c. buttermilk", "2 eggs", "1 tsp. vanilla extract"]}, {"section": "Strawberries:", "items": ["2 lbs. whole strawberries"]}, {"section": "Chocolate Glaze:", "items": ["3 ounces (1/2 cup mounded) Enjoy Life Semi-Sweet Mega Chunks", "3 Tbsp. water", "1 Tbsp. butter", "1 c. powdered sugar", "1 tsp. pure vanilla extract"]}, {"section": "Whipped Cream:", "items": ["1 1/4 c. heavy whipping cream", "1/2 c. powdered sugar", "1 tsp. pure vanilla extract"]}], "instructions": [{"section": "Gluten-free Chocolate Cake Layers:", "steps": ["Spray two 8\" or 9\" cake pans with cooking oil.", "In your mixing bowl, combine flour, xanthan gum (if needed), sugar, baking soda, and salt.", "In a medium saucepan, combine butter, cocoa, and 1 cup water. Bring just to boiling, whisking constantly. Remove from heat and add to dry ingredients, beat until combined.", "Add buttermilk, eggs, and vanilla to mixing bowl and beat for one minute on low-medium speed.", "Pour batter into greased pan. Bake at 350° for about 32 minutes. A toothpick inserted into cakes near center will come out with moist crumbs attached, but not wet batter. I also rotated my cake pans partway through baking to help them bake evenly.", "Place pans on a cooling rack to cool for 10 to 15 minutes. Then I like to use a plastic knife to loosen the", "around the edges of the", "and place the", "upside down on a", "rack to", "the", "to fall free from the", ". (Do this carefully!)"]}, {"section": "Strawberries:", "steps": ["While the cakes are cooling, wash the strawberries. Set aside 3-6 strawberries that look nice and leave them whole for dipping later (3 large or 6 smaller).", "Cut the tops of remaining strawberries, then slice each strawberry in half. Set aside."]}, {"section": "Chocolate Glaze:", "steps": ["Add semi-sweet chocolate chunks, water, and butter to a microwave safe bowl. Microwave on high in 30 second increments, stirring after each 30 seconds, until chocolate is melted.", "Whisk in powdered sugar and vanilla extract until smooth."]}], "url": "https://mygluten-freekitchen.com/gluten-free-chocolate-strawberry-layer-cake/"},
{"title": "Gluten-free Cheesecake", "ingredients": [{"section": "Crust:", "items": ["1 3/4 cups gluten-free graham cracker crumbs (from an 8 oz box)", "1 Tablespoon sugar", "1/2 teaspoon cinnamon", "pinch of kosher salt", "4 Tablespoons melted butter"]}, {"section": "Filling:", "items": ["4 packages (8 oz. each) cream cheese, softened", "1 cup sugar", "4 eggs (room temperature)", "1 cup sour cream", "2 teaspoons lemon juice", "1 Tablespoon cornstarch", "1 teaspoon vanilla"]}], "instructions": [{"section": "Instructions", "steps": ["°Preheat oven to 350°F. Butter the bottom and sides of a 9-inch springform pan. Set aside.", "Add gluten-free graham crackers to a food processor and process until finely ground. Pour graham cracker crumbs into a medium sized bowl and whisk together with sugar, cinnamon and salt. Then pour melted butter over the top and mix until the crust mixture resembles wet sand.", "Press the graham cracker mixture into the bottom of the springform pan.", "Bake at 350°F for 10-12 minutes, until the crust is lightly browned and fragrant. Remove from the oven and cool for at least 10  minutes while preparing the filling. (Keep the oven on!)", "To make the filling, combine softened cream cheese and sugar in a large mixing bowl. Beat on high for 1-2 minutes, until light and creamy. Add the eggs, one at a time, scraping down the bowl in between each addition. Then, add the sour cream, lemon juice, cornstarch and vanilla and mix only until combined and smooth.", "Pour the cheesecake filling over the crust and smooth with a spatula. Place cheesecake in the preheated oven and immediately lower the oven temperature to 300°F. Bake for 55 minutes to an hour, until the edges of the cheesecake are set (the center will still be a bit wobbly). Turn off the oven and let the cheesecake sit in the oven for another hour. Remove the cheesecake from the oven and carefully loosen the edges of the cheesecake from the sides", "of the pan with a knife, but leave the cheesecake in the pan. Let the cheesecake come to room temperature.", "Cover the cheesecake and refrigerator for at least 4 hours, preferably overnight. Remove the cheesecake from the springform pan and top with fresh berries and powdered sugar or other favorite toppings before serving."]}], "url": "https://mygluten-freekitchen.com/gluten-free-cheesecake/"},
{"title": "Simple Guacamole Recipe", "ingredients": [{"section": "General", "items": ["3 small/medium avocados", "1 Tbsp. fresh squeezed lime juice, strained to remove seeds", "1 clove garlic, minced", "3/4 tsp. sea salt", "1/8 tsp. black pepper"]}], "instructions": [{"section": "Instructions", "steps": ["In a small/medium bowl, use a fork to mash avocados.", "Stir in remaining ingredients until well mixed. Taste. Add additional seasonings if needed to your preferred taste. Keep in mind not to add extra salt as you'll be dipping salty tortilla chips in this!", "For best results, serve the same day as you make it."]}], "url": "https://mygluten-freekitchen.com/garlicky-guacamole-gluten-free/"},
{"title": "Simple Coleslaw Recipe (Gluten-free)", "ingredients": [{"section": "General", "items": ["16 ounces shredded cabbage", "1 cup shredded (matchstick) carrots", "⅔ cup mayonnaise", "1 teaspoon white wine vinegar", "1 teaspoon sugar", "1 teaspoon salt", "½ teaspoon black pepper"]}], "instructions": [{"section": "Instructions", "steps": ["In a large bowl, stir together cabbage and carrots.", "Add mayonnaise and vinegar and stir to mix well.", "Add white wine vinegar, sugar, salt and pepper and mix well.", "Serve immediately or cover tightly with plastic wrap and store in refrigerator until ready to serve."]}], "url": "https://mygluten-freekitchen.com/simple-coleslaw-recipe-gluten-free/"},
{"title": "Gluten-free Sweet and Sour Pork", "ingredients": [{"section": "General", "items": ["1 1/2 lbs. pork tenderloin, cut into 1-2 inch cubes", "2/3 cup cornstarch", "1/4 tsp. pepper", "1/2 tsp. garlic salt", "1/4 cup oil (your choice)", "1 can (20 oz.) pineapple chunks, drained", "1 green bell pepper, sliced", "1 red bell pepper, sliced"]}, {"section": "Sauce:", "items": ["3/4 cup sugar", "1/4 cup ketchup", "1/2 cup apple cider vinegar (use slightly less if using fresh, strong cider)", "1 Tbsp. gluten-free soy sauce", "1 tsp. garlic salt"]}], "instructions": [{"section": "Instructions", "steps": ["Cut the pork tenderloin into 1 to 2 inch cubes or strips.", "Add cornstarch, pepper and garlic salt to a bowl and whisk together.", "Add the pork chunks. Stir together until pork chunks are all coated with the cornstarch mixture .", "In a large, non-stick skillet, add the oil. Once the oil is hot, add half of the pork pieces and cook just until brown, but not cooked through, flipping pieces to brown two sides.", "Remove pork from pan and place into a 9x13 baking dish. I like to line mine with aluminum foil for easy clean-up.", "Repeat with rest of pork.", "Add one can of pineapple chunks (be sure to drain first), and the sliced bell peppers to the pork.", "Set baking dish aside while you make the sauce.", "In a medium sized bowl, whisk together the sugar, ketchup, apple cider vinegar, gluten-free soy sauce, and garlic salt. Pour over the pork, pineapple, pepper mixture.", "Bake for one hour at 325°. Every 15 minutes, remove from oven and stir, flipping pork pieces.", "Remove from oven and serve over rice.", "Bonus: If you want extra sauce for drizzling, make a second batch of sauce and add to a small saucepan. Bring it to a boil. Whisk constantly and let it cook over medium heat until thickened and reduced, about 7 minutes. Then serve alongside the finished sweet and sour chicken for those that want additional sauce."]}], "url": "https://mygluten-freekitchen.com/gluten-free-sweet-and-sour-pork/"},
{"title": "Gluten-free Peanut Butter Butterscotch Rice Crispy Treats (no-bake)", "ingredients": [{"section": "General", "items": ["1 cup butterscotch morsels", "1/2 cup creamy peanut butter", "3 cups gluten-free crispy rice cereal", "3/4 cup chocolate chips (semi-sweet or milk chocolate)"]}], "instructions": [{"section": "Instructions", "steps": ["In a 3 quart saucepan, combine the butterscotch chips and peanut butter. Cook over low until smooth, stirring constantly.", "Remove from heat. Stir in the gluten-free crisp rice cereal until it's all mixed in and coated well.", "Use a small cookie scoop or a tablespoon to scoop out balls of this crispy mixture. Press the scoop against the inside of the pan as you scoop so that it packs it in tight, which will help them stay together. Release the scoop onto wax paper. I like to put my wax paper on a large jelly roll pan so I can move the pan of them as needed and not worry about them all sliding off onto the floor.", "If any of the bites fall apart, just press together with your fingers.", "Let these set while you prepare the chocolate topping.", "In a small glass bowl, microwave the chocolate in 30 second increments, stirring in between, until the chocolate is melted, smooth, and shiny.", "Now you can decide how you want to top your no bake bites with chocolate!", "You can either dip the bites in chocolate, fill a pastry bag or ziploc bag to drizzle chocolate on them, or just put a dallop of melted chocolate on each. Try a few to see what you like best or what's easiest given the amount of time you have!"]}], "url": "https://mygluten-freekitchen.com/gluten-free-peanut-butter-butterscotch-crispy-treats/"},
{"title": "Gluten-free Cornbread Stuffing", "ingredients": [{"section": "General", "items": ["4 tablespoons butter (½ stick)", "1 yellow onion, diced", "4 stalks celery, diced", "1 clove garlic, minced", "1 tsp. dried thyme", "2 Tbsp. fresh sage", "3/4 cup dried cranberries", "1/4 tsp. salt", "1/4 tsp. ground black pepper", "2 eggs, beaten", "1-2 cups chicken broth or vegetable broth"]}], "instructions": [{"section": "Cornbread Cubes:", "steps": ["You can do this a day or two before. Simply cut the baked and cooled gluten-free cornbread into cubes and leave it out on the counter for a day or two so that it dries out. (I suggest spreading onto parchment paper or large baking sheets). This helps the cornbread from getting too soggy in the stuffing.", "If you are short on time, bake the cornbread and follow these steps to quickly dry it out, then proceed with rest of recipe: Cube the cornbread and place on a baking sheet lined with aluminum foil in a single layer. Make sure that the cornbread isn’t too crowded on the pan. Use an additional baking sheet if need be. Bake in the oven at 325°F for 25 to 30 minutes, flipping halfway through until the bread is lightly toasted and dry."]}, {"section": "Cornbread Stuffing:", "steps": ["Preheat oven to 350°F. Butter or oil a 9x13-inch baking dish and set aside.", "Preheat a large skillet over medium heat. Add the butter and melt completely. Then add the diced onion and celery to the skillet and cook for 5-7 minutes, until translucent.", "Add the minced garlic and cook an additional 1-2 minutes, stirring frequently, to ensure the garlic does not burn.", "Remove from heat. Add the onion, celery and garlic mixture to a large bowl. Add the dried cranberries, cubed cornbread, dried thyme, fresh sage, salt, pepper, beaten eggs and 1 cup of the chicken broth.", "Use a wooden spoon or spatula to stir to combine. Add additional chicken broth if needed. Mixture should be moist but not at all soupy.", "Spoon the gluten-free cornbread mixture into the prepared baking dish.", "Cover the baking dish with aluminum foil and bake at 350°F for 25 minutes. Remove the foil and bake an additional 15-20 minutes, until the top is a light golden brown.", "Let cool a few minutes before serving."]}], "url": "https://mygluten-freekitchen.com/gluten-free-cornbread-stuffing/"},
{"title": "Gluten-free Pumpkin Bread with Streusel Topping", "ingredients": [{"section": "Loaf:", "items": ["1 1/4 cup pumpkin puree (plain canned pumpkin puree not pumpkin pie filling)", "3/4 cup corn or vegetable oil", "3 large eggs", "1 cup sugar", "1 cup brown sugar", "2 cups gluten-free flour blend*", "1 Tablespoon ground cinnamon", "1 tsp. ground ginger", "1 tsp. salt", "1 tsp. baking soda", "3/4 tsp. ground nutmeg", "1/2 tsp. baking powder", "1/2 tsp. ground cloves"]}, {"section": "Streusel:", "items": ["1/2 cup brown sugar", "1/3 cup gluten-free flour blend", "2 Tablespoons sugar", "2 Tablespoons cinnamon", "1/4 cup butter (=4 Tablespoons or 1/2 stick), melted"]}, {"section": "Glaze:", "items": ["1/4 cup butter (=4 Tablespoons or 1/2 stick)", "1 cup powdered sugar", "2 Tablespoons pure maple syrup", "pinch of salt", "2-3 Tablespoons of milk, as needed to thin glaze"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat your oven to 350°.", "Line your loaf pan with parchment paper and spray it with non-stick spray.", "In a large mixing bowl, whisk together the pumpkin and oil. Next add the eggs and whisk until well combined. Then mix in the sugar and brown sugar. Set aside.", "In another bowl, combine the gluten-free flour, cinnamon, ginger, salt, baking soda, nutmeg, baking powder and cloves. Whisk together.", "Add the dry ingredients into the wet ingredients and mix until just combined.", "Pour the batter into the prepared loaf pan.", "Streusel: In a small bowl, mix together the brown sugar, gluten-free flour blend, sugar, and cinnamon. Add in the melted butter and mix with a fork until the mixture is crumbly. Evenly sprinkle the streusel on top of the batter in the loaf pan.", "Bake in the 350° preheated oven for 60-80 minutes or until the streusel has browned and a toothpick inserted in center comes out clean or with moist crumbs only, not wet batter. The wide range of time is because there isn’t a strict standard size/shape of full-size loaf pans – some are wide, some are long, some are skinny but tall. So start checking your loaf for doneness at 60 minutes, and then every 5 minutes until it tests done. When finished baking, remove and place on cooling rack to cool.", "While the bread is baking, make the glaze. Place butter in a small saucepan on medium-low heat until slightly browned, about 2-2.5 minutes. Be careful not to let this burn. Remove from heat and pour into a metal mixing bowl. Add the powdered sugar, pure maple syrup and salt and mix. Add milk about a teaspoon at a time until you achieve the drizzling consistency you want. Drizzle the glaze over the baked loaf.", "Allow to cool completely before slicing bread to enjoy!"]}], "url": "https://mygluten-freekitchen.com/gluten-free-pumpkin-bread-with-streusel-topping/"},
{"title": "Gluten-free Slow Cooker Turkey and Rice Soup", "ingredients": [{"section": "General", "items": ["2 Medium Carrots, sliced thin", "1 cup diced onion", "1 cup diced celery", "1 cup uncooked brown rice, rinsed well and drained", "4 garlic cloves, minced, or 4 tsp. jarred minced garlic", "1 teaspoon salt", "1 teaspoon dried oregano", "1 teaspoon dried thyme", "1/2 teaspoon dried rosemary", "1/2 teaspoon pepper", "1 bay leaf", "6 cups gluten-free chicken broth or stock or homemade turkey broth", "2 cups diced or shredded cooked turkey", "1 cup frozen peas", "fresh parsley, chopped fine for garnish, optional"]}], "instructions": [{"section": "Instructions", "steps": ["Place the carrots, onion, celery, brown rice, garlic, salt, pepper, oregano, thyme, rosemary, bay leaf, and then the chicken broth/stock into the crock of your slow cooker. Stir to combine.", "Cover. Cook on high heat for 2.5 hours.", "Add the turkey and peas, stir, then cover. Continue cooking on high for an additional hour or until the veggies are cooked to your preference.", "Serve with a garnish of parsley if desired."]}], "url": "https://mygluten-freekitchen.com/gluten-free-slow-cooker-turkey-and-rice-soup/"},
{"title": "Coconut Milk Strawberry Banana Smoothie (Gluten-free)", "ingredients": [{"section": "General", "items": ["1 cup frozen strawberries", "1 frozen banana", "1 cup coconut milk", "1 Tbsp. shredded coconut", "1/4 tsp. pure vanilla extract"]}], "instructions": [{"section": "Instructions", "steps": ["Add all ingredients to a blender.", "Blend on medium speed (or use smoothie setting if your blender has one) and blend until reaches typical smoothie consistency.", "Pour into a glass. Top with additional coconut if desired."]}], "url": "https://mygluten-freekitchen.com/coconut-milk-strawberry-banana-smoothie-gluten-free/"},
{"title": "Gluten-free Reese’s Brownies", "ingredients": [{"section": "General", "items": ["1 cup butter, melted (2 sticks)", "3 cups sugar", "1 Tbsp. pure vanilla extract", "4 eggs", "1 1/2 cups gluten-free all-purpose flour", "1/2 tsp. xanthan gum (*if needed, see note)", "1 cup cocoa powder", "1 tsp. salt", "1 1/2 cups chopped peanut butter cups (=about 14 Reese's cups)", "1/2 cup Reese's peanut butter baking chips"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 350°. Lightly grease a 9x13 baking dish. I prefer using a glass one.", "In a mixing bowl, combine the melted butter, sugar, and vanilla. Beat in the eggs, one at a time, mixing well after each, until thoroughly blended.", "In a separate bowl, whisk together the flour, xanthan gum, cocoa powder, and salt. Gradually stir the flour mixture into the butter mixture in the mixing bowl until blended. Stir in the chopped peanut butter cups and the Reese's peanut butter chips. Spread the batter evenly into the prepared baking dish.", "Bake in a preheated oven at 350° for about 35-40 minutes, or until a toothpick inserted near the center comes out clean or with moist crumbs only, no batter.", "Remove from oven, and cool pan on a wire rack before cutting.", "I recommend using a plastic knife for cutting these.", "You can sprinkle cooled brownies with additional chopped peanut butter cups if desired."]}], "url": "https://mygluten-freekitchen.com/reeses-brownies-gluten-free/"},
{"title": "Gluten-free Oatmeal Butterscotch Cookies", "ingredients": [{"section": "General", "items": ["3/4 cup salted butter, melted (1 1/2 sticks or 12 Tbsp)", "1 cup brown sugar", "1/2 cup sugar", "1 egg", "1 tsp. pure vanilla extract", "1 1/2 cups gluten-free flour blend", "1 tsp. baking powder", "1/2 tsp cinnamon", "1/4 tsp. baking soda", "2 cups gluten-free rolled oats", "1 1/4 cups butterscotch chips"]}], "instructions": [{"section": "Instructions", "steps": ["Preheat oven to 375°. Line your cookie baking sheets with parchment paper - this helps the cookies not stick and also bake evenly.", "Start by melting the butter. I usually do this in a microwaveable bowl, microwaving in 30 second increments. Be sure to cover with a paper towel or it tends to splatter butter all over the microwave.", "To your mixing bowl, pour in the melted butter, then add brown sugar, sugar, egg, and pure vanilla extract and mix. I use my stand mixer for this, on medium speed for one minute to mix well.", "Add gluten-free all-purpose flour blend, baking powder, cinnamon, baking soda, cinnamon. Mix on low just until mixed.", "Stir in the oats and the butterscotch chips. You can do this by hand or with mixer on low.", "Decide whether you want medium or large sized cookies. For large cookies, grab a #20 large cookie scoop and use it to scoop 8-9 cookies per sheet. Each cookie dough ball scooped with this size scoop will be 3 Tablespoons sized and weigh about 2 ounces if you prefer to weigh. You'll get about 22 large cookies doing it this way.", "For medium cookies, grab a medium cookie scoop", "(#40) to scoop your cookie dough balls. They will be 1 1/2 Tablespoon sized cookie balls that weigh about 1 ounce. You'll get about 30 medium cookies doing it this way.", "Bake at 375°. Large cookies bake for about 13 minutes. Medium cookies baked for about 8-9 minutes. These will be crunchier and drier the longer they bake, so error on the side of underdone.", "When they're done baking, remove from oven and place on cooling racks to cool completely. If you need to use the same cookie sheets for next batch, allow the sheets to cool before using again or the cookies will spread more on the hot sheet."]}], "url": "https://mygluten-freekitchen.com/gluten-free-oatmeal-butterscotch-cookies/"},
{"title": "Slow Cooker Shredded Chicken for Gluten-free Tacos", "ingredients": [{"section": "General", "items": ["1 cup gluten-free chicken broth (recommend Pacific)", "1 packet gluten-free taco seasoning mix or 2-3 Tbsp. homemade seasoning", "2 lbs. boneless, skinless chicken breasts or tenders (thawed)"]}], "instructions": [{"section": "Instructions", "steps": ["Pour the chicken broth and seasoning into the slow cooker.", "Place the chicken breasts in the broth.", "Cover and cook on low for 4 hours.", "After chicken has cooked, use two forks to shred it into small pieces. I shred it right in the slow cooker.", "Use with your favorite toppings and tortillas for tacos, enchiladas, quesadillas, nachos, etc."]}], "url": "https://mygluten-freekitchen.com/slow-cooker-chicken-tacos-gluten-free/"},
{"title": "Gluten-free Risotto with Mushrooms", "ingredients": [{"section": "General", "items": ["3 Tablespoons olive oil", "1 pound mushrooms, sliced", "1/4 cup white wine vinegar", "1/4-1/2 cup sliced chives or scallions or green onions", "1/2 teaspoon salt", "4 cups low sodium vegetable broth", "2 cups uncooked arborio rice"]}], "instructions": [{"section": "Instructions", "steps": ["Place Instant Pot on sauté setting and add the oil to the Instant Pot insert.", "Add the sliced mushrooms, white wine vinegar, chives, and salt. Sauté for 4-5 minutes.", "Add 2 cups of the vegetable broth and all of the rice. Sauté for an additional 3-4 minutes. Be careful to stir slightly so rice does not stick to bottom of the Instant Pot Insert.", "Add the rest of the vegetable broth and close the lid.", "Cancel out the sauté mode on the Instant Pot and seal the lid. Place on high pressure for 5 minutes.", "Once finished, use quick release (careful, steam is HOT).", "Scoop from Instant pot to your bowl for serving or directly onto individual plates.", "You can garnish with more chives or scallions or green onions or some parsley."]}], "url": "https://mygluten-freekitchen.com/gluten-free-risotto-with-mushrooms/"},
{"title": "Gluten-free Flourless Chocolate Cake", "ingredients": [{"section": "Cake:", "items": ["6 Tbsp. salted butter, plus more for pan", "8 ounces semisweet chocolate, finely chopped (or chocolate chips)", "6 large eggs, separated", "1/2 cup sugar"]}, {"section": "Whipped Cream", "items": ["1 1/4 c. heavy whipped cream", "1/2 c. powdered sugar", "1 tsp. pure vanilla extract"]}], "instructions": [{"section": "Flourless cake:", "steps": ["Preheat the oven to 275°. Butter the bottom and sides of a 9\" springform pan. Set aside.", "Place butter and chocolate in a large, microwaveable bowl and microwave in 30-second increments, stirring after each 30 seconds, until completely melted. Let cool slightly.", "Whisk in egg yolks.", "In medium or large bowl, beat egg whites until soft peaks form. Gradually add the sugar, and continue beating until glossy stiff peaks form. Whisk 1/4 of the egg whites into the chocolate mixture.", "Using a spatula, gently fold in remaining egg whites.", "Pour batter into the prepared pan, and smooth the top with a rubber spatula.", "Bake at 275° until the cake pulls away from the sides of the pan and is set in the center, 45-50 minutes.", "Cool completely on a wire rack; remove sides of pan."]}, {"section": "HOMEMADE WHIPPED CREAM:", "steps": ["To a mixing bowl, add the whipping cream, powdered sugar, and pure vanilla extract.", "Use the whisk attachment to beat on high speed until stiff peaks form. Set aside.", "If not using right away, cover and chill until serving."]}], "url": "https://mygluten-freekitchen.com/flourless-chocolate-cake-gluten-free/"},
{"title": "Gluten-free Chicken Marinade for Grilled Lemon Chicken", "ingredients": [{"section": "General", "items": ["6 Tbsp. lemon juice (fresh, from 2 lemons)", "6 Tbsp. olive oil", "2 tsp. minced garlic (from 3-4 cloves)", "2 tsp. salt", "1/2 tsp. pepper", "2 pounds boneless, skinless chicken tenders or breasts trimmed into strips"]}], "instructions": [{"section": "Instructions", "steps": ["Line a small/medium sized bowl with a gallon Ziploc bag, folding the top of the bag over the sides of the bowl.", "Add the lemon juice, olive oil, minced garlic, salt, and pepper to the bag.", "Seal the bag and gently knead the bag from the outside to mix the contents.", "Unseal and put the bag back into the bowl, again folding the top of the bag over the sides of the bowl.", "As you trim your chicken tenders or breasts, drop them right into the bag in the bowl. When done, seal the bag up.", "Again, use your hands to gently knead the bag from the outside to mix the marinade and chicken thoroughly.", "Put the bag in the bowl, and place the bowl in the fridge to marinate for 6-8 hours. This way, if you by chance have any leak from the bag, it will be caught in the bowl, so you don't end up with a messy fridge!", "After marinating, remove chicken from bag and place on grill over direct heat.", "Discard bag and remaining marinade. Do not reuse.", "Grill chicken over direct heat for 1 minute each side. Then move to top rack/indirect heat and grill for 8 minutes or until cooked through, flipping partway through.", "Grill until chicken registers 165° in center on a digital thermometer.", "Serve with your favorite sides and additional lemon wedges."]}], "url": "https://mygluten-freekitchen.com/grilled-lemon-garlic-chicken-gluten-free/"},
{"title": "Gluten-free Pull-Apart Dinner Rolls {dairy-free option}", "ingredients": [{"section": "General", "items": ["2¾ cups (11½ oz.) very good quality gluten-free flour blend", "1 1/2 tsp. xanthan gum", "2 tsp. SAF instant yeast", "1/4 cup sugar", "1 tsp. salt", "1 cup warm water (105-110°)", "2 Tbsp. butter, dairy-free margarine, or Spectrum shortening", "1 egg (preferably room temp)", "1 tsp. cider vinegar"]}], "instructions": [{"section": "Instructions", "steps": ["In the mixing bowl of your electric mixer, mix together flour, xanthan gum, instant yeast, sugar, and salt.", "With mixer running on low speed, add in the hot water (be sure to test temperature with thermometer, melted butter (or substitute), egg, and cider vinegar.", "Mix on medium speed 3 minutes.", "Spray 8\" or 9\" round cake pan or pie plate with cooking spray. Using a 2\" scoop or 1/3 cup measuring cup, scoop dough into 9 mounds in the pan. I place one mound in middle, then scoop 8 mounds of dough side by side all the way around the pan.", "Dip your fingertips into warm water and use to smooth out the tops of the rolls, continuing to wet fingers as needed.", "Cover with a dry towel and let rise in a warm place 45 minutes to 1 hour.", "During the last few minutes that the rolls are rising, preheat the empty oven to 400°. (if you were rising your rolls in the oven, remove and place on counter during oven preheat).", "Bake in 400° oven for 25-28 minutes. Tops should be golden brown and if you measure temperature of dough, it should measure 200°.", "Brush rolls with additional 1/2-1 Tablespoon of melted butter."]}], "url": "https://mygluten-freekitchen.com/pull-apart-dinner-rolls-gluten-free/"},
{"title": "Gluten-free Dutch Apple Pie with Streusel Crust", "ingredients": [{"section": "Snickerdoodle Streusel:", "items": ["14-16 ounces of gluten-free Snickerdoodle cookies", "4 Tbsp brown sugar", "1/2 cup butter (=1 stick)"]}, {"section": "Apple Pie Filling:", "items": ["6 cups peeled, sliced tart apples", "2 Tbsp. lemon juice", "2 Tbsp butter", "2 Tbsp. brown sugar", "1 Tbsp. gluten-free flour blend (or cornstarch)", "2 tsp. cinnamon", "1/4 tsp. nutmeg"]}], "instructions": [{"section": "Snickerdoodle Streusel:", "steps": ["Lightly spray inside bottom and sides of pie plate with non-stick cooking spray. Set aside.", "Using a food processor or food chopper, pulse the Snickerdoodle cookies until mixture is coarse crumbs with some larger chunks. (See photo in blog post.)", "Transfer cookie crumbs to a medium sized bowl. Add brown sugar and whisk until blended together.", "Melt the butter, then pour over the cookie crumb mixture. Use a fork to mix together, creating our Snickerdoodle streusel.", "Scoop out 1 cup of streusel; set aside for use as topping later. Press remaining streusel firmly and evenly in bottom and up sides of the lightly greased pie plate.", "Set pie aside and turn oven on to 375° to preheat while you make the apple pie filling."]}, {"section": "Apple Pie filling:", "steps": ["Peel and thinly slice 6 cups worth of apples. I cut each apple slice in half again so pieces would be smaller for faster cooking time. Stir together apple slices and lemon juice.", "In a large nonstick skillet, melt 2 Tablespoons of butter. Add apple slices and brown sugar. Stir, cover, and cook over medium-low heat for 10-12 minutes, stirring occasionally. Cooking time will vary greatly based on variety/firmness of your apples and how soft you like them. Your goal here is to cook them just a tad bit less than you want the finished product. The time in the oven will finish them off.", "Stir in 1 tablespoon of gluten-free flour, cinnamon and nutmeg. This will absorb the liquid and make nice saucy apples. As soon as the liquid has decreased (usually within a minute), remove from heat.", "Scoop apple pie filling into the prepared crust.", "Sprinkle with reserved snickerdoodle streusel.", "Bake at 375° for 18 minutes. Topping will be nicely browned and apples should be cooked perfectly.", "Remove from oven, let cool a bit and enjoy! This is delicious both warm or at room temperature. We enjoyed this plain or with vanilla ice cream, but homemade whipped cream is yummy on this too!"]}], "url": "https://mygluten-freekitchen.com/snickerdoodle-streusel-apple-pie-gluten-free/"},
{"title": "Gluten-free Cornbread Muffins", "ingredients": [{"section": "General", "items": ["1 cup buttermilk", "1 tsp. baking soda", "1/2 cup melted butter (=1 stick or 8 Tbsp.)", "1/2 cup sugar", "2 eggs", "1 cup cornmeal", "1 cup gluten-free flour blend", "1/2 tsp. xanthan gum* (if needed)", "1/2 tsp. baking powder", "1/2 tsp. salt"]}], "instructions": [{"section": "Instructions", "steps": ["In a glass measuring cup, measure buttermilk, then add baking soda. Mix together and let sit.", "Place melted butter into a large mixing bowl. Add sugar and use a spatula or wooden spoon to mix into the butter. Add eggs and stir.", "Add buttermilk/baking soda mixture to the butter/sugar/egg mixture and mix just until combined.", "In a separate bowl, whisk together cornmeal, gluten-free flour, baking powder, and salt. Add to wet ingredients and stir.", "Preheat oven to 375°. Use cooking spray to coat the bottom and sides of each of the 12 cups of the muffin pan. I do not recommend using paper liners or foil liners.", "Use a large scoop to scoop the cookie dough evenly among the 12 muffin cups.", "Bake at 375° for 14-15 minutes, or until a toothpick inserted into a muffin comes out clean and muffins just start to brown a bit.", "Remove from oven and place on cooling rack. Let cool for 5 minutes in pan, then remove from pan and place in basket or on plate for serving."]}], "url": "https://mygluten-freekitchen.com/gluten-free-cornbread-muffins/"},
{"title": "Gluten-free Slow Cooker Pot Roast", "ingredients": [{"section": "General", "items": ["3lbs. chuck roast/pot roast/rump roast", "5 medium red or gold potatoes, cut in about 1.5\" cubes (leave skins on)", "1/2 lb. baby carrots, cut in 1/2", "3/4 cup sliced mushrooms", "1 tsp. garlic powder", "1 tsp salt", "1 tsp. pepper", "1 box (12 oz.) Pacific Natural Foods Organic Cream of Mushroom Condensed Soup*", "1 cup hot water", "1 cube or 1 tsp. Herb-ox gluten-free beef bouillon granules"]}, {"section": "For the gravy after cooking:", "items": ["1/4 cup cold water", "2 Tbsp. corn starch"]}], "instructions": [{"section": "Instructions", "steps": ["Trim excess fat from roast. Place roast in slow cooker.", "Layer potatoes, carrots and mushrooms around sides and top of roast.", "Sprinkle with garlic powder, salt, and pepper to cover well.", "Pour in condensed cream of mushroom soup.", "Mix together the 1 cup hot water with the beef bouillon. Pour over the roast and veggies.", "Put lid on and cook on LOW for about 8 hours, up to 10 hours.", "Before serving, scoop out about 1.5-2 cups of the liquid that is in the slow cooker. Put liquid in a saucepan on the stove. Add to it 2 Tbsp. cornstarch that is dissolved in 1/4 cup cold water.", "Stirring constantly, bring to a boil over medium heat and boil 1 minute or until gravy is thick. Season to taste with more garlic powder, salt, and pepper.", "Serve roast with the veggies and the gravy."]}], "url": "https://mygluten-freekitchen.com/slow-cooker-pot-roast-gluten-free/"},
{"title": "Instant Pot Rice and Beans Recipe", "ingredients": [{"section": "General", "items": ["2 large peppers (medium or hot)", "1 can (16 oz.) black beans, drained and rinsed", "1 can (16 oz.) pinto beans, drained and rinsed", "1 can (15.5 oz.) enchilada sauce", "1 can (14.5 oz.) petite diced tomatoes in sauce", "1 1/2 cups white Basmati rice, uncooked", "2 cups vegetable broth", "1 cup sour cream", "2 cups shredded Mexican cheese"]}], "instructions": [{"section": "Instructions", "steps": ["Slice the peppers, discard the seeds, and chop the peppers. You should get about 1/2 cup peppers. (Use more if desired!) Add the chopped peppers right into the bowl of your pressure cooker", "Drain and rinse beans and add to pressure cooker.", "Add enchilada sauce and tomatoes to pressure cooker.", "Add uncooked white rice to pressure cooker.", "Pour vegetable broth over all. Don't stir!", "Close the lid on your Instant Pot or pressure cooker. Close the steam valve.", "Press Pressure Cook, set the time for 10 minutes, Press Pressure level and select low pressure. If your pressure cooker has a start button, then push that, mine just automatically starts.", "Pressure Cooker will take time to come up to pressure. Mine took 17 minutes. Then it starts the 10 minutes of cooking. Once the timer goes off, carefully slip the steam valve to do a quick release of all pressure. Once all pressure is released, carefully remove lid.", "Stir in the sour cream.", "Stir in the shredded cheese.", "Serve immediately or let cool to thicken a bit. Serve as a filling for tacos and burritos or serve with chips as a dip."]}], "url": "https://mygluten-freekitchen.com/instant-pot-rice-and-beans-recipe/"},
{"title": "Gluten-free Cheeseburger Soup", "ingredients": [{"section": "General", "items": ["1/2 cup butter (1 stick), divided", "1 lb. ground beef or ground turkey", "1 cup spinach leaves", "1 1/2 cups shredded carrots", "2 Tbsp. minced garlic (about 3 cloves)", "2 tsp. dried parsley", "6 cups gluten-free chicken broth (recommend Pacific)", "9 cups cubed potatoes (~3/4\" cubes), preferably butter gold or Yukon gold", "1/4 cup cornstarch", "4 cups cubed cheddar cheese (about 1.25 pounds)", "3 cups milk", "1/2 cup sour cream", "2 Tbsp. garlic salt", "1/2 tsp. pepper"]}], "instructions": [{"section": "Instructions", "steps": ["Prepare veggies: I use a small food processor/chopper to chop the spinach and the shredded carrots to make them very small. Peel and cut the potatoes into cubes that are about 3/4\" in size. Mince the garlic.", "In a large stockpot, melt 2 tablespoons of butter over medium heat. Add the ground beef, spinach, carrots, and garlic and cook and stir until beef is brown.", "Add the broth, potatoes, and parsley.", "Bring to a boil, stir, then turn to low heat, cover pot with lid, and let simmer until the potatoes are tender, about 12 minutes.", "In a smaller pot, melt the remaining butter, then whisk in the cornstarch. Add the milk, whisking until smooth. Bring to a boil until starts to thicken, about 2 minutes, then remove from heat.", "Gradually add the milk mixture into the stockpot once the potatoes are tender. Stirring constantly, bring to a boil and let boil for 2 minutes to thicken the soup. Reduce heat to simmer and stir in cheese cubes.", "When cheese is melted, add sour cream, garlic salt, and pepper. Stir until all is warmed through to desired temperature. Taste to see if you would prefer additional garlic salt or pepper.", "Serve with gluten-free rolls or gluten-free cornbread.", "Leftovers can be refrigerated or frozen. To enjoy leftovers, you'll want to add a bit of milk when reheating. You can reheat in the microwave or on stove top."]}], "url": "https://mygluten-freekitchen.com/cheeseburger-soup-gluten-free/"}
]